Repository: aridaisantana/Conversor-numbers-to-word-in-polish.
Catalog: ServicioNumerosPolacoWCF/App_GlobalResources/Resource.*.resx
Languages: es, pl

# CabeceraNumeroFormateado2
source: How to write number
es: ¿Cómo se escribe el número
pl: Jak napisać liczbę

# CabeceraNumeroFormateado3
source: in polish?
es: en letras en polaco?
pl: po polsku?

# CardinalNotas1
source: Digits from zero to nine are rendered by specific words, namely zero [0], jeden [1], dwa [2], trzy [3], cztery [4], pięć [5], sześć [6], siedem [7], osiem [8], and dziewięć [9].
es: Las cifras del cero al nueve tienen nombres específicos: zero [0], jeden [1], dwa [2], trzy [3], cztery [4], pięć [5], sześć [6], siedem [7], osiem [8] y dziewięć [9].
pl: Cyfry od zera do dziewięciu są oddawane przez konkretne słowa, a mianowicie zero [0], jeden [1], dwa [2], trzy [3], cztery [4], pięć [5], sześć [6], siedem [7], osiem [8], and dziewięć [9].

# CardinalNotas2
source: Tens are formed by stating the multiplier digit before a variation of the word for ten (dziesięć, dzieścia, dzieści or dziesiąt), except for ten itself: dziesięć [10], dwadzieścia [20], trzydzieści [30], czterdzieści [40], pięćdziesiąt [50], sześćdziesiąt [60], siedemdziesiąt [70], osiemdziesiąt [80], and dziewięćdziesiąt [90].
es: Las decenas se forman poniendo la cifra multiplicadora antes una forma de la palabra para diez (dziesięć, dzieścia, dzieści o dziesiąt), excepto para diez mismo: dziesięć [10], dwadzieścia [20], trzydzieści [30], czterdzieści [40], pięćdziesiąt [50], sześćdziesiąt [60], siedemdziesiąt [70], osiemdziesiąt [80] y dziewięćdziesiąt [90].
pl: Dziesiątki tworzy się, podając cyfrę mnożenia przed odmianą słowa oznaczającego dziesięć (dziesięć, dzieścia, dzieści lub dziesiąt), z wyjątkiem samej dziesiątki: dziesięć [10], dwadzieścia [20], trzydzieści [30], czterdzieści [40], pięćdziesiąt [50], sześćdziesiąt [60], siedemdziesiąt [70], osiemdziesiąt [80], i dziewięćdziesiąt [90].

# CardinalNotas3
source: Teens are formed by starting with the unit, directly followed by naście, from na (and) and dziesięć (ten): jedenaście [11] (literally, one and ten), dwanaście [12], trzynaście [13], czternaście [14], piętnaście [15], szesnaście [16], siedemnaście [17], osiemnaście [18], and dziewiętnaście [19].
es: Los números del once al diecinueve se forman empezando por la unidad, directamente seguida por naście, de na (y) y dziesięć (diez): jedenaście [11] (literalemente, uno y diez), dwanaście [12], trzynaście [13], czternaście [14], piętnaście [15], szesnaście [16], siedemnaście [17], osiemnaście [18] y dziewiętnaście [19].
pl: Dziesiątki tworzy się, zaczynając od jednostki, po której bezpośrednio następuje naście, od na (i) oraz dziesięć (dziesięć): jedenaście [11] (dosł. jeden i dziesięć), dwanaście [12], trzynaście [13], czternaście [14], piętnaście [15], szesnaście [16], siedemnaście [17], osiemnaście [18], i dziewiętnaście [19].

# CardinalNotas4
source: Compound numbers above twenty are formed by starting with the ten, then the unit separated with a space (e.g.: dwadzieścia jeden [21], pięćdziesiąt trzy [53]).
es: Los números compuestos más grandes que veinte se forman empezando por la decena, y luego la unidad separada por un espacio (ejemplo: dwadzieścia jeden [21], pięćdziesiąt trzy [53]).
pl: Liczby złożone powyżej dwudziestu tworzy się, zaczynając od dziesiątki, a następnie od jednostki oddzielonej spacją (np.: dwadzieścia jeden [21], pięćdziesiąt trzy [53]).

# CardinalNotas5
source: Hundreds are formed by stating the multiplier digit before a form of the word for hundred (ście, sta or set) with no space, except for one hundred: sto [100], dwieście [200], trzysta [300], czterysta [400], pięćset [500], sześćset [600], siedemset [700], osiemset [800], and dziewięćset [900].
es: Las centenas se forman poniendo la cifra multiplicadora antes una forma de la palabra para cien (ście, sta o set) sin espacio, excepto para cien mismo: sto [100], dwieście [200], trzysta [300], czterysta [400], pięćset [500], sześćset [600], siedemset [700], osiemset [800] y dziewięćset [900].
pl: Setki tworzy się, podając cyfrę mnożnika przed formą słowa oznaczającego sto (ście, sta lub set) bez odstępu, z wyjątkiem stu: sto [100], dwieście [200], trzysta [300], czterysta [400], pięćset [500], sześćset [600], siedemset [700], osiemset [800] i dziewięćset [900].

# CardinalNotas6
source: Thousands are formed by stating the multiplier digit before a form of the word for thousand (tysiąc, tysiące or tysięcy) separated with a space, except for one thousand: tysiąc [1,000], dwa tysiące [2,000], trzy tysiące [3,000], cztery tysiące [4,000], pięć tysięcy [5,000], sześć tysięcy [6,000], siedem tysięcy [7,000], osiem tysięcy [8,000], and dziewięć tysięcy [9,000].
es: Los miles se forman poniendo la cifra multiplicadora antes una forma de la palabra para mil (tysiąc, tysiące o tysięcy) separada por un espacio, excepto para mil: tysiąc [1 000], dwa tysiące [2 000], trzy tysiące [3 000], cztery tysiące [4 000], pięć tysięcy [5 000], sześć tysięcy [6 000], siedem tysięcy [7 000], osiem tysięcy [8 000] y dziewięć tysięcy [9 000].
pl: Tysiące tworzy się, podając cyfrę mnożenia przed formą słowa oznaczającego tysiąc (tysiąc, tysiące lub tysiące) oddzieloną spacją, z wyjątkiem tysiąca: tysiąc [1,000], dwa tysiące [2,000], trzy tysiące [3,000], cztery tysiące [4,000], pięć tysięcy [5,000], sześć tysięcy [6,000], siedem tysięcy [7,000], osiem tysięcy [8,000], i dziewięć tysięcy [9,000].

# CardinalNotas7
source: The Polish language uses the long scale naming convention.
es: La lengua polaca usa la convención de nomenclatura de la escala larga. Las palabras para los números grandes son: milion (millón, 106), miliard (mil millones, 109), bilion (billón, 1012), biliard (mil billones, 1015), trylion (trillón, 1018), tryliard (mil trillones, 1021), kwadrylion (quadrillón, 1024)…
pl: W języku polskim stosuje się konwencję nazewnictwa w skali długiej.

# CardinalTipo
source: Cardinal
pl: Kardynał

# Ejemplos
source: Example
es: Ejemplos
pl: Przykład

source: ERROR
pl: BŁĄD

# FraccionarioTipo
source: Fractional
es: Fraccionario
pl: Ułamkowa

# Lista1
source: The cardinal, ordinal, partitive, multiplicative, collective text is shown and its Roman numeral and more... corresponding to the written number.
es: Se muestra el texto cardinal, ordinal, fraccionario, multiplicativo, romano y más... correspondiente al número escrito.
pl: Pokazany jest tekst kardynalny, porządkowy, cząstkowy, mnożnikowy, zbiorowy oraz jego cyfra rzymska i inne... odpowiadające zapisanej liczbie.

# Lista10
source: The numerator is too large.
es: El numerador es demasiado grande.
pl: Licznik jest zbyt duży.

# Lista11
source: The decimal part is too large.
es: La parte decimal es demasiado grande.
pl: Część dziesiętna jest zbyt duża.

# Lista12
source: <b>DON'T write a number with letters, except the Roman numeral</b>.
es: <b>NO escriba el número con letras, excepto si es un número romano</b>.
pl: <b>Nie pisz liczby za pomocą liter, z wyjątkiem cyfry rzymskiej</b>.

# Lista13
source: The divisor is too large.
es: El divisor es demasiado grande.
pl: Dzielnik jest zbyt duży.

# Lista14
source: The exponent is too large.
es: El exponente es demasiado grande.
pl: Wykładnik jest zbyt duży.

# Lista15
source: Unknown error.
es: Error desconocido.
pl: Nieznany błąd.

# Lista16
source: Please, send an email to tulengua.es@gmal.com with the number that you typed.
es: Por favor, informe a tulengua.es@gmail.com con la cifra que ha escrito.
pl: Wyślij wiadomość e-mail na adres tulengua.es@gmail.com, podając numer, który wpisałeś.

# Lista17
source: We will try to solve as soon as possible.
es: Intentaremos solucionarlo pronto.
pl: Postaramy się rozwiązać problem tak szybko, jak to możliwe.

# Lista18
source: We apologize for any inconvenience.
es: Disculpe las molestias.
pl: Przepraszamy za wszelkie niedogodności.

# Lista19
source: <b>Currency symbols (€, £, ¥, etc.) are not supported for this language.</b> We are working on it ...
es: <b>Los símbolos de monedas (€, £, ¥, etc. ) no están admitidos para este idioma.</b> Estamos trabajando en ello...
pl: Symbole walutowe (€, £, ¥ itd.) nie są obsługiwane w tym języku. Pracujemy nad tym ...

# Lista2
source: Write a number without comma or decimal point for the thousands or millions:
es: Escriba un número sin coma ni punto para los miles o millones:
pl: Zapisz liczbę bez przecinka lub przecinka dziesiętnego dla tysięcy lub milionów:

# Lista20
source: The number, exponent or decimal part may be too large.
es: <b>Puede que el número, el exponente o la parte decimal sea demasiado grande.</b>
pl: Liczba, wykładnik lub część dziesiętna mogą być zbyt duże.

# Lista21
source: You can write amounts in <b> euros </b> with the € symbol or the word <i> euros </i>:
es: Escriba cantidades en <b>euros</b> con el símbolo € o la palabra <i>euros</i>:
pl: Kwoty w <b>euro </b> można zapisywać za pomocą symbolu € lub słowa euro :

# Lista22
source: You can write amounts in <b>pesos</b> with the $ symbol or the word <i>pesos</i>:
es: Escriba cantidades en <b>pesos</b> con el símbolo $ o la palabra <i>pesos</i>:
pl: Kwoty w <b>pesos</b> można zapisywać za pomocą symbolu $ lub słowa pesos:

# Lista23
source: You can write amounts in <b>dólares</b> with the $ symbol or the word <i>dólares</i>:
es: Escriba cantidades en <b>dólares</b> con el símbolo $ o la palabra <i>dólares</i>:
pl: Kwoty w <b>dolarach</b> można zapisywać za pomocą symbolu $ lub słowa dólares:

# Lista3
source: You can separate the thousands or millions with a blank space:
es: Los miles o millones se pueden separar con un espacio en blanco:
pl: Tysiące lub miliony można oddzielić pustym miejscem:

# Lista4
source: In decimal, you can use a decimal point or comma:
es: En lo decimales puede usar un punto o una coma:
pl: W zapisie dziesiętnym można użyć przecinka lub kropki:

# Lista5
source: You can write fractions with the bar:
es: Para escribir fracciones use la barra:
pl: Ułamki można zapisywać za pomocą tabliczki:

# Lista6
source: In scientific notation, you can use the letter E without spaces:
es: Para escribr en notación científica use la E sin espacios:
pl: W notacji naukowej można używać litery E bez spacji:

# Lista7
source: For Roman numeral, you can write in capital letter all symbols:
es: Si es un número romano, escriba en mayúscula todos sus símbolos:
pl: W przypadku cyfr rzymskich wszystkie symbole można pisać wielką literą:

# Lista9
source: The number is too large.
es: El número es demasiado grande.
pl: Liczba ta jest zbyt duża.

# MultiplicativoTipo
source: Multiplicative
es: Multiplicativo
pl: Multiplikatywny

# Notas
source: Notes
es: Notas
pl: Uwagi

# NumeroRomanoCorrecto
source: Correct Roman numeral
es: Número romano correcto
pl: Prawidłowa cyfra rzymska

# NumeroRomanoIncorrecto
source: Wrong Roman numeral
es: Número romano incorrecto
pl: Nieprawidłowa cyfra rzymska

# Opciones
source: All options
es: Todas las opciones y funciones
pl: Wszystkie opcje

# OrdinalTipo
source: Ordinal
pl: Strona porządkowa

# Referencias
source: Reference
es: Referencias
pl: Odnośnik

# ValorNumerico
source: Numerical value
es: Valor numérico
pl: Wartość liczbowa

# Lista8
source: The supported formats for Chinese are as follows:
es: Los formatos admitidos para el polaco son los siguientes:

# RomanoTipo
source: Roman
es: Romano
